<?php

$a = 5; 
$b = '05';
echo '<pre>';
var_dump($a == $b);  //true, поскольку неявное сравнение
var_dump((int)'012345'); //12345 - целочисленное число
var_dump((float)123.0 === (int)123.0); // false, поскольку при преобразовании int будет 123, а не 123.0
var_dump(0 == 'hello, world'); // false, поскольку строка не равна числовому значению, однако в php версии 7.4 строка приравнивалась к нулю, поэтому и было true


$a = 1; 
$b = 2;
echo "a1 ="." ".$a.";\n";
echo "b1 ="." ".$b.";\n"; 
$a = $a + $b; // 1 + 2 = 3
$b = $a - $b; // 3 - 2 = 1
$a = $a - $b; // 3 - 1 = 2

echo "a2 ="." ".$a.";\n";
echo "b2 ="." ".$b.";";

echo '</pre>';
// a = 2, b = 1
